actgrp
alias
align
alloc
alt
altseq


acq
begsr
callp
chain
clear


%ABS
%ADDR
%ALLOC
%BITAND
%BITNOT
%BITOR


*IN
*IN01
*IN02
*IN03
*IN04


*all
*allg
*allu
*allz
*allthread


ALLOCATE CURSOR
ALLOCATE DESCRIPTOR
ALTER FUNCTION
ALTER MASK
ALTER PERMISSION


and
by
downto
not
or
to

/copy
/define
/eject
/else
/elseif
/end-free

















