000100160505**free
000101160505
000102160505dcl-s ans char(1);
000103160505//dsply 'Hello World' '' ans;  // Will wait for a response - just hit ENTER
000104160505dcl-s name char(10) inz('Jim');
000105160505dcl-s name2 char(10) inz('Jill');
000106160505
000107160505
000108160505dcl-c MAX_ELEMS 100;
000109160505dcl-c default_city_name 'London';
000110160505
000111160505dcl-s num int(10);
000112160505
000113160505dcl-s greeting char(20);
000114160505
000115160505
000116160505dcl-s age packed(5);
000117160505
000118160505dcl-ds info qualified;
000119160505  name char(10) inz('Sam');
000120160505  salary packed(9 : 2) inz(50000.25);
000121160505end-ds;
000122160505
000123160505
000124160505dcl-ds otherInfo likeds(info) inz(*likeds);
000125160505
000126160505
000127160505
000128160505
000129160505
000130160505
000131160505
000132160505//dcl-s dates date(*iso) dim(3);
000133160505//dcl-s date1 date;
000134160505//date1 = %date('040596': *MDY0);
000135160505
000136160505    dcl-s dates date(*iso) dim(3);
000137160505
000138160505    dates(1) = %date();               // the current date
000139160505    dates(2) = dates(1) + %days(1);   // tomorrow
000140160505    dates(3) = dates(1) + %years(1); // next year
000141160505    dsply (%char(dates(1)) + ' '
000142160505         + %char(dates(2)) + ' '
000143160505         + %char(dates(3)));
000144160505
000145160505
000146160505greeting = 'hello';
000147160505
000148160505dsply name;
000149160505
000150160505
000151160505
000152160505dsply max_elems;
000153160505dsply default_city_name;
000154160505
000155160505
000156160505
000157160505
000158160505for num = 1 to 3;
000159160505  dsply ('i = ' + %char(num));
000160160505endfor;
000161160505
000162160505
000163160505
000164160505dsply ('greeting is: ' + greeting);
000165160505
000166160505
000167160505dsply (%trim(info.name)
000168160505     + ' has a salary of '
000169160505     + %char(info.salary));
000170160505
000171160505
000172160505dsply name2 '' ans;
000173160505
000174160505
000175160505
000176160505
000177160505otherInfo.name = 'Stanley';
000178160505otherInfo.salary += 10000;
000179160505
000180160505dsply (
000181160505 %trim (
000182160505 %char(otherInfo.salary)
000183160505
000184160505     + ' is the salary of '
000185160505     + otherInfo.name
000186160505     )
000187160505      + ' END'
000188160505     )
000189160505     ;
000190160505
000191160505
000192160505
000193160505  return;
000194160505
000195160505
000196160505
000197160505
000198160505
